<?php
/*------------------------------------------ Условия задачи ------------------------------------------*/
/*
Дан массив: 
$country = [
	[
		'country' => 'Россия',
		'city' =>    'Москва',
	],
	[
		'country' => 'Беларусь',
		'city' =>    'Минск',
	],
	[
		'country' => 'Россия',
		'city' =>    'Питер',
	],
	[
		'country' => 'Россия',
		'city' =>    'Владивосток',
	],
	[
		'country' => 'Украина',
		'city' =>    'Львов',
	],
	[
		'country' => 'Беларусь',
		'city' =>    'Могилев',
	],
	[
		'country' => 'Украина',
		'city' =>    'Киев',
	],
];
Напишите код, которой переделает структуру данных вот в такую:
[
	'Россия'=> [
		'Москва', 'Питер', 'Владивосток',
	],
	'Беларусь'=> [
		'Минск', 'Могилев'
	],
	'Украина'=> [
		'Киев', 'Львов'
	],
]
*/
/*------------------------------------------ Решение ------------------------------------------*/

$country = [
	[
		'country' => 'Россия',
		'city' =>    'Москва',
	],
	[
		'country' => 'Беларусь',
		'city' =>    'Минск',
	],
	[
		'country' => 'Россия',
		'city' =>    'Питер',
	],
	[
		'country' => 'Россия',
		'city' =>    'Владивосток',
	],
	[
		'country' => 'Украина',
		'city' =>    'Львов',
	],
	[
		'country' => 'Беларусь',
		'city' =>    'Могилев',
	],
	[
		'country' => 'Украина',
		'city' =>    'Киев',
	],
];

$country_sort = [];

foreach($country as $a) {
    if($a['country'] == 'Россия'){
        $country_sort['Россия'][] = $a['city'];
    } elseif ($a['country'] == 'Украина') { 
		$country_sort['Украина'][] = $a['city'];
	} else {
		$country_sort['Беларусь'][] = $a['city'];
	}
}
$country = $country_sort;