<?php
/*------------------------------------------ Условия задачи ------------------------------------------*/
// Дан массив: 
// $date = [
//     [
//         'date'  => '2019-12-29',
//         'event' => 'name1'
//     ],
//     [
//         'date'  => '2019-12-31',
//         'event' => 'name2'
//     ],
//     [
//         'date'  => '2019-12-29',
//         'event' => 'name3'
//     ],
//     [
//         'date'  => '2019-12-30',
//         'event' => 'name4'
//     ],
//     [
//         'date'  => '2019-12-29',
//         'event' => 'name5'
//     ],
//     [
//         'date'  => '2019-12-31',
//         'event' => 'name6'
//     ],
//     [
//         'date'  => '2019-12-29',
//         'event' => 'name7'
//     ],
//     [
//         'date'  => '2019-12-30',
//         'event' => 'name8'
//     ],
//     [
//         'date'  => '2019-12-30',
//         'event' => 'name9'
//     ],
// ];
//Напишите код, которой переделает структуру данных вот в такую:
// [
//     [2019-12-29] => [
//             [0] => name1,
//             [1] => name3,
//             [2] => name5,
//             [3] => name7
//     ],
//     [2019-12-31] => [
//             [0] => name2,
//             [1] => name6
//     ],
//     [2019-12-30] => [
//             [0] => name4,
//             [1] => name8,
//             [2] => name9
//     ]
// ]

/*------------------------------------------ Решение ------------------------------------------*/

$date = [
    [
        'date'  => '2019-12-29',
        'event' => 'name1'
    ],
    [
        'date'  => '2019-12-31',
        'event' => 'name2'
    ],
    [
        'date'  => '2019-12-29',
        'event' => 'name3'
    ],
    [
        'date'  => '2019-12-30',
        'event' => 'name4'
    ],
    [
        'date'  => '2019-12-29',
        'event' => 'name5'
    ],
    [
        'date'  => '2019-12-31',
        'event' => 'name6'
    ],
    [
        'date'  => '2019-12-29',
        'event' => 'name7'
    ],
    [
        'date'  => '2019-12-30',
        'event' => 'name8'
    ],
    [
        'date'  => '2019-12-30',
        'event' => 'name9'
    ],
];

$date_sort = [];

foreach ($date as $a) {
    if ($a['date'] == '2019-12-30') {
        $date_sort[$a['date']][] = $a['event'];
    } elseif ($a['date'] == '2019-12-29') {
        $date_sort[$a['date']][] = $a['event'];
    } else {
        $date_sort[$a['date']][] = $a['event'];
    }
}
$date = $date_sort;